# ===== タップ =====
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "leoafarias/fvm"
tap "ngrok/ngrok"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "powershell/tap"
tap "qmk/qmk"
tap "sanemat/font"

# ===== 開発ツール =====
brew "neovim"
brew "git-delta"
brew "gh"
brew "lazygit"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "bat"
brew "eza"
brew "zoxide"
brew "jq"
brew "tmux"
brew "btop"
brew "procs"
brew "pstree"
brew "glow"
brew "wget"
brew "netcat"
brew "multitime"

# ===== 言語・ランタイム =====
brew "rbenv"
brew "ruby-build"
brew "fnm"
brew "node"
brew "nodebrew"
brew "go"
brew "go-task"
brew "rustup"
brew "python@3.12"
brew "uv"
brew "openjdk"
brew "cocoapods"
brew "leoafarias/fvm/fvm"

# ===== シェル・プロンプト =====
brew "sheldon"
brew "starship"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# ===== フォーマッター・リンター =====
brew "stylua"

# ===== データベース =====
brew "mysql"
brew "mysql-client"
brew "mysql@8.0"
brew "postgresql@14", restart_service: :changed
brew "postgresql@15"
brew "postgresql@16", restart_service: :changed
brew "redis", restart_service: :changed

# ===== インフラ・クラウド =====
brew "awscli"
brew "aws2-wrap"
brew "azure-cli"
brew "qemu"
brew "powershell"

# ===== 画像・グラフィック =====
brew "imagemagick"
brew "graphviz"
brew "libraqm"
brew "pillow"

# ===== ライブラリ =====
brew "openssl@1.1"
brew "autoconf"
brew "automake"
brew "glib"
brew "cairo"
brew "harfbuzz"
brew "libtool"
brew "pango"
brew "zstd"

# ===== キーボード =====
brew "qmk/qmk/qmk"

# ===== その他 =====
brew "duckdb"
brew "sl"
brew "sanemat/font/ricty"

# ===== フォント =====
cask "font-hackgen"
cask "font-hackgen-nerd"
cask "font-hack-nerd-font"
cask "font-fira-code-nerd-font"

# ===== アプリケーション =====
cask "wezterm"
cask "docker-desktop"
cask "visual-studio-code"
cask "raycast"
cask "slack"
cask "tableplus"
cask "karabiner-elements"
cask "alt-tab"
cask "spotify"
cask "zoom"
cask "iterm2"
cask "displaylink"
cask "google-japanese-ime"
cask "wireshark-app"

# ===== 開発系アプリ =====
cask "android-studio"
cask "flutter"
cask "finch"
cask "claude-code"
cask "codex"
cask "kiro"
cask "ngrok"
cask "session-manager-plugin"
cask "hacker-menu"

# ===== VSCode 拡張機能 =====
vscode "anthropic.claude-code"
vscode "github.copilot-chat"
vscode "shopify.ruby-lsp"
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "eamodio.gitlens"
vscode "usernamehw.errorlens"
vscode "pkief.material-icon-theme"
vscode "vscode-icons-team.vscode-icons"
vscode "dracula-theme.theme-dracula"
vscode "christian-kohler.path-intellisense"
vscode "ecmel.vscode-html-css"
vscode "zignd.html-css-class-completion"
vscode "xabikos.javascriptsnippets"
vscode "shardulm94.trailing-spaces"
vscode "mosapride.zenkaku"
vscode "oderwat.indent-rainbow"
vscode "mechatroner.rainbow-csv"
vscode "repreng.csv"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-mermaid"
vscode "yzane.markdown-pdf"
vscode "kuone.sequence-number"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-themes"
vscode "ms-azuretools.vscode-containers"
vscode "koichisasada.vscode-rdbg"
vscode "kaiwood.endwise"
vscode "sianglim.slim"
vscode "chaitanyashahare.lazygit"
vscode "saoudrizwan.claude-dev"
vscode "openai.chatgpt"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "mquandalle.graphql"
vscode "sankethdev.vscode-proto"
vscode "svelte.svelte-vscode"
vscode "1yib.svelte-bundle"
vscode "fivethree.vscode-svelte-snippets"
vscode "ardenivanov.svelte-intellisense"
vscode "1yib.rust-bundle"
vscode "rust-lang.rust-analyzer"
vscode "dustypomerleau.rust-syntax"
vscode "fill-labs.dependi"
vscode "apenara.gas-intellisense"

# ===== Go ツール =====
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"

# ===== Cargo ツール =====
cargo "cargo-nextest"
cargo "mdbook"
cargo "sea-orm-cli"
